
// *****************************************************************************************************************************
// マスターデータ
// -----------------------------------------------------------------------------------------------------------------------------

var Master = { __dummy: null

	// *****************************************************************************************************************************
	// プレイヤー
	// -----------------------------------------------------------------------------------------------------------------------------

	, players: [
		{
			playerId: 0, level: 1, name: 'セリカ'		// セリカ
			, params: [20, 8, 0, 6, 6, 8, 4, 7, 4], growths: [50, 60, 0, 50, 50, 45, 35, 4, 0]
		}
		, {
			playerId: 1, level: 1, name: 'メイ'			// メイ
			, params: [20, 9, 0, 1, 7, 5, 2, 10, 4], growths: [35, 60, 0, 35, 40, 40, 30, 2, 0]
		}
		, {
			playerId: 2, level: 1, name: 'ボーイ'		// ボーイ
			, params: [22, 8, 0, 2, 4, 9, 4, 7, 4], growths: [55, 45, 0, 55, 30, 25, 45, 1, 0]
		}
		, {
			playerId: 3, level: 1, name: 'ジェニー'		// ジェニー
			, params: [18, 7, 0, 2, 5, 7, 1, 13, 4], growths: [30, 60, 0, 50, 30, 35, 20, 5, 0]
		}
	]

	// *****************************************************************************************************************************
	// クラス
	// -----------------------------------------------------------------------------------------------------------------------------

	, klasses: [
		{
			klassId: 132, name: '神官'					// 神官(セリカ)
			, params: [24, 5, 0, 1, 1, 0, 1, 0, 4], growths: [0, 0, 0, 0, 0, 0, 0, 0, 0]
			, baseWeaponIds: [0, 4]
		}
		, {
			klassId: 999, name: '傭兵'					// 傭兵
			, params: [24, 8, 0, 8, 10, 0, 4, 1, 4], growths: [0, -5, 0, 5, 5, 0, -5, 0, 0]
			, baseWeaponIds: [0]
		}
		, {
			klassId: 999, name: 'アーチャー'			// アーチャー
			, params: [24, 9, 0, 1, 2, 0, 3, 0, 4], growths: [-5, 0, 0, 10, -5, 0, -5, 0, 0]
			, baseWeaponIds: [3]
		}
		, {
			klassId: 89, name: '魔道士'					// 魔道士(男)
			, params: [28, 8, 0, 3, 4, 0, 5, 8, 4], growths: [0, 5, 0, 5, 0, 0, -10, 0, 0]
			, baseWeaponIds: [4]
		}
		, {
			klassId: 133, name: '魔道士'				// 魔道士(女)
			, params: [20, 9, 0, 1, 7, 5, 2, 10, 4], growths: [-10, 5, 0, -5, 5, 0, -5, 1, 0]
			, baseWeaponIds: [4]
		}
		, {
			klassId: 91, name: 'シスター'				// シスター
			, params: [18, 7, 0, 2, 4, 4, 1, 10, 4], growths: [-10, 0, 0, 0, 0, 5, -10, 2, 0]
			, baseWeaponIds: [9]
		}
		, {
			klassId: 6, name: '盗賊'					// 盗賊
			, params: [26, 7, 0, 1, 2, 0, 2, 0, 4], growths: [0, 0, 0, 0, 0, 0, 0, 0, 0], enemyGrowths: [120, 45, 0, 40, 45, 0, 40, 10, 0]
			, baseWeaponIds: [2]
		}
		, {
			klassId: 39, name: 'ゾンビ'					// ゾンビ
			, params: [36, 5, 0, 1, 1, 0, 1, 0, 4], growths: [0, 0, 0, 0, 0, 0, 0, 0, 0], enemyGrowths: [120, 50, 0, 40, 30, 0, 20, 0, 0]
			, baseWeaponIds: [2]
		}
	]

	// *****************************************************************************************************************************
	// 初期化
	// -----------------------------------------------------------------------------------------------------------------------------

	, initialize: function() {

		// マップ
		//this.mapById = [];
		//for (var i = 0; i < this.maps.length; i++) {
		//	var mapId = this.maps[i].mapId;
		//	this.mapById[mapId] = this.maps[i];
		//}

		// プレイヤー
		this.playerById = [];
		for (var i = 0; i < this.players.length; i++) {
			var playerId = this.players[i].playerId;
			this.playerById[playerId] = this.players[i];
		}

		// クラス
		this.klassById = [];
		for (var i = 0; i < this.klasses.length; i++) {
			var klassId = this.klasses[i].klassId;
			this.klassById[klassId] = this.klasses[i];
		}
	}
};


