
// *****************************************************************************************************************************
// ウィンドウ
// -----------------------------------------------------------------------------------------------------------------------------

(function() {

	// *****************************************************************************************************************************
	// UnitSentence.Avoid
	// -----------------------------------------------------------------------------------------------------------------------------

	UnitSentence.Avoid.setCalculatorValue = function(unit, weapon, totalStatus) {

		// getAvoid に武器も渡す
		this._value = AbilityCalculator.getAvoid(unit, weapon) + totalStatus.avoidTotal;
	};

	// *****************************************************************************************************************************
	// UnitMenuBottomWindow
	// -----------------------------------------------------------------------------------------------------------------------------

	UnitMenuBottomWindow.getWindowHeight = function() {

		// アイテム欄の高さ
		var itemsHeight = DefineControl.getUnitMenuBottomWindowHeight();

		// ステータス欄の高さ
		var statusHeight = this._statusScrollbar.getScrollbarHeight();

		// 大きい方を返す
		return Math.max(itemsHeight, statusHeight);
	}

})();



